Revit 2026 API

# UpdaterRegistryAddTrigger(UpdaterId, Document, ICollectionElementId, ChangeType) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void AddTrigger(
	UpdaterId id,
	Document document,
	ICollection<ElementId> elements,
	ChangeType change
)
```
```vb
Public Shared Sub AddTrigger (
	id As UpdaterId,
	document As Document,
	elements As ICollection(Of ElementId),
	change As ChangeType
)
```
```cpp
public:
static void AddTrigger(
	UpdaterId^ id,
	Document^ document,
	ICollection<ElementId^>^ elements,
	ChangeType^ change
)
```
```fsharp
static member AddTrigger :
        id : UpdaterId *
        document : Document *
        elements : ICollection<ElementId> *
        change : ChangeType -> unit
```

#### Parameters

id UpdaterId

document Document

elements ICollectionElementId

change ChangeType

#### Reference

UpdaterRegistry Class

AddTrigger Overload

Autodesk.Revit.DB Namespace